leetcode/226.org
#+TITLE:       226. Invert Binary Tree My Submissions Question
#+AUTHOR:      enzo liu
#+EMAIL:       liuenze6516@gmail.com
#+DATE:        2016-02-28 Thu
#+URI:         /leetcode/226
#+KEYWORDS:    leetcode, ruby
#+TAGS:        leetcode, ruby
#+LANGUAGE:    en
#+OPTIONS:     H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: leetcode

* 题目

[[https://leetcode.com/problems/invert-binary-tree/][链接]]

#+BEGIN_VERSE
Invert a binary tree.

     4
   /   \
  2     7
 / \   / \
1   3 6   9

to

     4
   /   \
  7     2
 / \   / \
9   6 3   1

Trivia:

This problem was inspired by this original tweet by Max Howell:
Google: 90% of our engineers use the software you wrote (Homebrew), but you can’t invert a binary tree on a whiteboard so fuck off.

#+END_VERSE

* 思路

#+BEGIN_QUOTE
每个节点下的子节点交换即可.
#+END_QUOTE

* 代码

#+BEGIN_SRC ruby
  # Definition for a binary tree node.
  # class TreeNode
  #     attr_accessor :val, :left, :right
  #     def initialize(val)
  #         @val = val
  #         @left, @right = nil, nil
  #     end
  # end

  # @param {TreeNode} root
  # @return {TreeNode}
  def invert_tree(root)
    if root == nil then return root end
    root.left,root.right = invert_tree(root.right),invert_tree(root.left)
    root
  end
#+END_SRC
