leetcode/226/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>226. Invert Binary Tree My Submissions Question - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>226. Invert Binary Tree My Submissions Question</h1>
            
<div id="outline-container-orgc88f3da" class="outline-2">
<h2 id="orgc88f3da">题目</h2>
<div class="outline-text-2" id="text-orgc88f3da">
<p>
<a href="https://leetcode.com/problems/invert-binary-tree/">链接</a>
</p>

<p class="verse">
Invert a binary tree.<br />
<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;4<br />
&#xa0;&#xa0;&#xa0;/   \<br />
&#xa0;&#xa0;2     7<br />
&#xa0;/ \   / \<br />
1   3 6   9<br />
<br />
to<br />
<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;4<br />
&#xa0;&#xa0;&#xa0;/   \<br />
&#xa0;&#xa0;7     2<br />
&#xa0;/ \   / \<br />
9   6 3   1<br />
<br />
Trivia:<br />
<br />
This problem was inspired by this original tweet by Max Howell:<br />
Google: 90% of our engineers use the software you wrote (Homebrew), but you can’t invert a binary tree on a whiteboard so fuck off.<br />
<br />
</p>
</div>
</div>

<div id="outline-container-org148edd6" class="outline-2">
<h2 id="org148edd6">思路</h2>
<div class="outline-text-2" id="text-org148edd6">
<blockquote>
<p>
每个节点下的子节点交换即可.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-orged72e38" class="outline-2">
<h2 id="orged72e38">代码</h2>
<div class="outline-text-2" id="text-orged72e38">
<div class="org-src-container">
<pre class="src src-ruby"># Definition for a binary tree node.
# class TreeNode
#     attr_accessor :val, :left, :right
#     def initialize(val)
#         @val = val
#         @left, @right = nil, nil
#     end
# end

# @param {TreeNode} root
# @return {TreeNode}
def invert_tree(root)
  if root == nil then return root end
  root.left,root.right = invert_tree(root.right),invert_tree(root.left)
  root
end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-02-28</span>
        <span title="last modification date" class="post-info">2016-02-29</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
